feat: implement HibernateNotification CRD feature (#96)
* feat: implement Notification CRD feature

Signed-off-by: Ardika Bagus <me@ardikabs.com>

* fix: notif dispatcher startup and concurrency

Signed-off-by: Ardika Bagus <me@ardikabs.com>

* chore: change notify target info Message from ErrorMessage, and more docs reference

Signed-off-by: Ardika Bagus <me@ardikabs.com>

* chore: bump to go 1.25

Signed-off-by: Ardika Bagus <me@ardikabs.com>

* chore: eliminate ast.Package

Signed-off-by: Ardika Bagus <me@ardikabs.com>

---------

Signed-off-by: Ardika Bagus <me@ardikabs.com>
